espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/components/libraries/timer/app_timer_ble_gzll.c
/* Copyright (c) 2012 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#include "app_timer.h"
#include "app_util_platform.h"
#include <stdlib.h>
#include "nrf51.h"
#include "nrf51_bitfields.h"
#include "nrf_soc.h"
#include "nrf_assert.h"
#include "nrf_delay.h"
#include "app_util.h"

#define RTC1_IRQ_PRI            APP_IRQ_PRIORITY_LOW                            /**< Priority of the RTC1 interrupt (used for checking for timeouts and executing timeout handlers). */
#define SWI1_IRQ_PRI            APP_IRQ_PRIORITY_LOW                            /**< Priority of the SWI0 interrupt (used for updating the timer list). */

// The current design assumes that both interrupt handlers run at the same interrupt level.
// If this is to be changed, protection must be added to prevent them from interrupting each other
// (e.g. by using guard/trigger flags).
STATIC_ASSERT(RTC1_IRQ_PRI == SWI1_IRQ_PRI);

#define MAX_RTC_CNT             0x00FFFFFF                                      /**< Maximum value of the RTC counter. */

#define APP_HIGH_USER_ID        0                                               /**< User Id for the Application High "user". */
#define APP_LOW_USER_ID         1                                               /**< User Id for the Application Low "user". */
#define THREAD_MODE_USER_ID     2                                               /**< User Id for the Thread Mode "user". */

#define RTC_COMPARE_OFFSET_MIN  3                                               /**< Minimum offset between the current RTC counter value and the Capture Compare register. */
#define MAX_RTC_TASKS_DELAY     47                                              /**< Maximum delay until an RTC task is executed. */

/**@brief Timer accodation state type. */
typedef enum
{
    STATE_FREE,                                                                 /**< The timer node is available. */
    STATE_ALLOCATED                                                             /**< The timer node has been allocated. */
} timer_alloc_state_t;

/**@brief Timer node type. The nodes will be used form a linked list of running timers. */
typedef struct
{
    timer_alloc_state_t         state;                                          /**< Timer allocation state. */
    app_timer_mode_t            mode;                                           /**< Timer mode. */
    uint32_t                    ticks_to_expire;                                /**< Number of ticks from previous timer interrupt to timer expiry. */
    uint32_t                    ticks_at_start;                                 /**< Current RTC counter value when the timer was started. */
    uint32_t                    ticks_first_interval;                           /**< Number of ticks in the first timer interval. */
    uint32_t                    ticks_periodic_interval;                        /**< Timer period (for repeating timers). */
    bool                        is_running;                                     /**< True if timer is running, False otherwise. */
    app_timer_timeout_handler_t p_timeout_handler;                              /**< Pointer to function to be executed when the timer expires. */
    void *                      p_context;                                      /**< General purpose pointer. Will be passed to the timeout handler when the timer expires. */
    app_timer_id_t              next;                                           /**< Id of next timer in list of running timers. */
} timer_node_t;

STATIC_ASSERT(sizeof(timer_node_t) <= APP_TIMER_NODE_SIZE);
STATIC_ASSERT(sizeof(timer_node_t) % 4 == 0);

/**@brief Set of available timer operation types. */
typedef enum
{
    TIMER_USER_OP_TYPE_NONE,                                                    /**< Invalid timer operation type. */
    TIMER_USER_OP_TYPE_START,                                                   /**< Timer operation type Start. */
    TIMER_USER_OP_TYPE_STOP,                                                    /**< Timer operation type Stop. */
    TIMER_USER_OP_TYPE_STOP_ALL                                                 /**< Timer operation type Stop All. */
} timer_user_op_type_t;

/**@brief Structure describing a timer start operation. */
typedef struct
{
    uint32_t ticks_at_start;                                                    /**< Current RTC counter value when the timer was started. */
    uint32_t ticks_first_interval;                                              /**< Number of ticks in the first timer interval. */
    uint32_t ticks_periodic_interval;                                           /**< Timer period (for repeating timers). */
    void *   p_context;                                                         /**< General purpose pointer. Will be passed to the timeout handler when the timer expires. */
} timer_user_op_start_t;

/**@brief Structure describing a timer operation. */
typedef struct
{
    timer_user_op_type_t op_type;                                               /**< Timer operation type. */
    app_timer_id_t       timer_id;                                              /**< Id of timer on which the operation is to be performed. */
    union
    {
        timer_user_op_start_t start;                                            /**< Structure describing a timer start operation. */
    } params;
} timer_user_op_t;

STATIC_ASSERT(sizeof(timer_user_op_t) <= APP_TIMER_USER_OP_SIZE);
STATIC_ASSERT(sizeof(timer_user_op_t) % 4 == 0);

/**@brief Structure describing a timer user.
 *
 * @details For each user of the timer module, there will be a timer operations queue. This queue
 *          will hold timer operations issued by this user until the timer interrupt handler
 *          processes these operations. For the current implementation, there will be one user for
 *          each interrupt level available to the application (APP_HIGH, APP_LOW and THREAD_MODE),
 *          but the module can easily be modified to have one queue per process when using an RTOS. 
 *          The purpose of the queues is to be able to have a completely lockless timer
 *          implementation.
 */
typedef struct
{
    uint8_t           first;                                                    /**< Index of first entry to have been inserted in the queue (i.e. the next entry to be executed). */
    uint8_t           last;                                                     /**< Index of last entry to have been inserted in the queue. */
    uint8_t           user_op_queue_size;                                       /**< Queue size. */
    timer_user_op_t * p_user_op_queue;                                          /**< Queue buffer. */
} timer_user_t;

STATIC_ASSERT(sizeof(timer_user_t) == APP_TIMER_USER_SIZE);
STATIC_ASSERT(sizeof(timer_user_t) % 4 == 0);

/**@brief User id type.
 *
 * @details In the current implementation, this will automatically be generated from the current
 *          interrupt level.
 */
typedef uint32_t timer_user_id_t;

#define TIMER_NULL                   ((app_timer_id_t)(0 - 1))                  /**< Invalid timer id. */
#define CONTEXT_QUEUE_SIZE_MAX       (2)                                        /**< Timer internal elapsed ticks queue size. */

