espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/components/libraries/timer/app_timer_ble_gzll.c
static uint8_t                       m_node_array_size;                         /**< Size of timer node array. */
static timer_node_t *                mp_nodes = NULL;                           /**< Array of timer nodes. */
static uint8_t                       m_user_array_size;                         /**< Size of timer user array. */
static timer_user_t *                mp_users;                                  /**< Array of timer users. */
static app_timer_id_t                m_timer_id_head;                           /**< First timer in list of running timers. */
static uint32_t                      m_ticks_latest;                            /**< Last known RTC counter value. */
static uint32_t                      m_ticks_elapsed[CONTEXT_QUEUE_SIZE_MAX];   /**< Timer internal elapsed ticks queue. */
static uint8_t                       m_ticks_elapsed_first;                     /**< Timer internal elapsed ticks queue read index. */
static uint8_t                       m_ticks_elapsed_last;                      /**< Timer internal elapsed ticks queue write index. */
static app_timer_evt_schedule_func_t m_evt_schedule_func;                       /**< Pointer to function for propagating timeout events to the scheduler. */


/**@brief Function for initializing and starting the RTC1 counter.
 *
 * @param[in] prescaler   Value of the RTC1 prescale register. Set to 0 for no prescaling.
 */
static void rtc1_init(uint32_t prescaler)
{
    NRF_RTC1->PRESCALER = prescaler;
    NVIC_SetPriority(RTC1_IRQn, RTC1_IRQ_PRI);
}


/**@brief Function for starting the RTC1 timer.
 */
static void rtc1_start(void)
{
    NRF_RTC1->EVTENSET = RTC_EVTEN_COMPARE0_Msk;
    NRF_RTC1->INTENSET = RTC_INTENSET_COMPARE0_Msk;

    NVIC_ClearPendingIRQ(RTC1_IRQn);
    NVIC_EnableIRQ(RTC1_IRQn);

    NRF_RTC1->TASKS_START = 1;
    nrf_delay_us(MAX_RTC_TASKS_DELAY);
}


/**@brief Function for stopping the RTC1 timer.
 */
static void rtc1_stop(void)
{
    NVIC_DisableIRQ(RTC1_IRQn);

    NRF_RTC1->EVTENCLR = RTC_EVTEN_COMPARE0_Msk;
    NRF_RTC1->INTENCLR = RTC_INTENSET_COMPARE0_Msk;

    NRF_RTC1->TASKS_STOP = 1;
    nrf_delay_us(MAX_RTC_TASKS_DELAY);
}


/**@brief Function for returning the current value of the RTC1 counter.
 *
 * @return     Current value of the RTC1 counter.
 */
static __INLINE uint32_t rtc1_counter_get(void)
{
    return NRF_RTC1->COUNTER;
}


/**@brief Function for computing the difference between two RTC1 counter values.
 *
 * @return     Number of ticks elapsed from ticks_old to ticks_now.
 */
static __INLINE uint32_t ticks_diff_get(uint32_t ticks_now, uint32_t ticks_old)
{
    if (ticks_now >= ticks_old)
    {
        return (ticks_now - ticks_old);
    }
    else
    {
        return (MAX_RTC_CNT + 1) - (ticks_old - ticks_now);
    }
}


/**@brief Function for setting the RTC1 Capture Compare register 0, and enabling the corresponding event.
 *
 * @param[in] value   New value of Capture Compare register 0.
 */
static __INLINE void rtc1_compare0_set(uint32_t value)
{
    NRF_RTC1->CC[0] = value;
}


/**@brief Function for inserting a timer in the timer list.
 *
 * @param[in]  timer_id   Id of timer to insert.
 */
static void timer_list_insert(app_timer_id_t timer_id)
{
    timer_node_t * p_timer = &mp_nodes[timer_id];
    
    if (m_timer_id_head == TIMER_NULL)
    {
        m_timer_id_head = timer_id;
    }
    else
    {
        if (p_timer->ticks_to_expire <= mp_nodes[m_timer_id_head].ticks_to_expire)
        {
            mp_nodes[m_timer_id_head].ticks_to_expire -= p_timer->ticks_to_expire;
            
            p_timer->next   = m_timer_id_head;
            m_timer_id_head = timer_id;
        }
        else
        {
            app_timer_id_t previous;
            app_timer_id_t current;
            uint32_t       ticks_to_expire;

            ticks_to_expire = p_timer->ticks_to_expire;
            previous        = m_timer_id_head;
            current         = m_timer_id_head;
            
            while ((current != TIMER_NULL) && (ticks_to_expire > mp_nodes[current].ticks_to_expire))
            {
                ticks_to_expire -= mp_nodes[current].ticks_to_expire;
                previous         = current;
                current          = mp_nodes[current].next;
            }

            if (current != TIMER_NULL)
            {
                mp_nodes[current].ticks_to_expire -= ticks_to_expire;
            }

            p_timer->ticks_to_expire = ticks_to_expire;
            p_timer->next            = current;
            mp_nodes[previous].next  = timer_id;
        }
    }
}


/**@brief Function for removing a timer from the timer queue.
 *
 * @param[in]  timer_id   Id of timer to remove.
 */
static void timer_list_remove(app_timer_id_t timer_id)
{
    app_timer_id_t previous;
    app_timer_id_t current;
    uint32_t       timeout;

    // Find the timer's position in timer list.
    previous = m_timer_id_head;
    current  = previous;
    
    while (current != TIMER_NULL)
    {
        if (current == timer_id)
        {
            break;
        }
        previous = current;
        current  = mp_nodes[current].next;
    }

    // Timer not in active list.
    if (current == TIMER_NULL)
    {
        return;
    }

    // Timer is the first in the list.
    if (previous == current)
    {
        m_timer_id_head = mp_nodes[m_timer_id_head].next;
    }

    // Remaining timeout between next timeout.
    timeout = mp_nodes[current].ticks_to_expire;

    // Link previous timer with next of this timer, i.e. removing the timer from list.
    mp_nodes[previous].next = mp_nodes[current].next;

    // If this is not the last timer, increment the next timer by this timer timeout.
    current = mp_nodes[previous].next;
    if (current != TIMER_NULL)
    {
        mp_nodes[current].ticks_to_expire += timeout;
    }
}


/**@brief Function for scheduling a check for timeouts by generating a RTC1 interrupt.
 */
static void timer_timeouts_check_sched(void)
{
    NVIC_SetPendingIRQ(RTC1_IRQn);
}


/**@brief Function for scheduling a timer list update by generating a SWI0 interrupt.
 */
static void timer_list_handler_sched(void)
{
    NVIC_SetPendingIRQ(SWI1_IRQn);
}


/**@brief Function for executing an application timeout handler, either by calling it directly, or by passing an
 *        event to the @ref app_scheduler.
 *
 * @param[in]  p_timer   Pointer to expired timer.
 */
static void timeout_handler_exec(timer_node_t * p_timer)
{
    if (m_evt_schedule_func != NULL)
    {
        uint32_t err_code = m_evt_schedule_func(p_timer->p_timeout_handler, p_timer->p_context);
        if (err_code != NRF_SUCCESS)
        {
            ASSERT(false);
        }
    }
    else
    {
        p_timer->p_timeout_handler(p_timer->p_context);
    }
}


/**@brief Function for checking for expired timers.
 */
static void timer_timeouts_check(void)
{
    // Handle expired of timer.
    if (m_timer_id_head != TIMER_NULL)
    {
        uint32_t ticks_expired;
        uint8_t  ticks_elapsed_last;

