espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/components/libraries/timer/app_timer_ble_gzll.c
        // Initialize actual elapsed ticks being consumed to 0. 
        ticks_expired = 0;

        // Queue the ticks elapsed (to make the value context safe).
        ticks_elapsed_last = m_ticks_elapsed_last + 1;
        if (ticks_elapsed_last == CONTEXT_QUEUE_SIZE_MAX)
        {
            ticks_elapsed_last = 0;
        }

        if (ticks_elapsed_last != m_ticks_elapsed_first)
        {
            app_timer_id_t timer_id;
            uint32_t       ticks_elapsed;

            // Ticks_elapsed is collected here, job will use it.
            ticks_elapsed = ticks_diff_get(rtc1_counter_get(), m_ticks_latest);

            // Auto variable containing the head of timers expiring.
            timer_id = m_timer_id_head;

            // Expire all timers within ticks_elapsed and collect ticks_expired.
            while (timer_id != TIMER_NULL)
            {
                timer_node_t * p_timer;

                // Auto variable for current timer node.
                p_timer = &mp_nodes[timer_id];

                // Do nothing if timer did not expire.
                if (ticks_elapsed < p_timer->ticks_to_expire)
                {
                    break;
                }

                // Decrement ticks_elapsed and collect expired ticks 
                ticks_elapsed -= p_timer->ticks_to_expire;
                ticks_expired += p_timer->ticks_to_expire;

                // Move to next timer 
                timer_id = p_timer->next;

                // Execute Task 
                timeout_handler_exec(p_timer);
            }
        }

        // Queue the elapsed value 
        m_ticks_elapsed[m_ticks_elapsed_last] = ticks_expired;
        m_ticks_elapsed_last                  = ticks_elapsed_last;

        timer_list_handler_sched();
    }
}


/**@brief Function for acquiring the number of ticks elapsed.
 *
 * @param[out] p_ticks_elapsed   Number of ticks elapsed.
 *
 * @return     TRUE if elapsed ticks was read from queue, FALSE otherwise.
 */
static bool elapsed_ticks_acquire(uint32_t * p_ticks_elapsed)
{
    // Pick the elapsed value from queue 
    if (m_ticks_elapsed_first != m_ticks_elapsed_last)
    {
        *p_ticks_elapsed = m_ticks_elapsed[m_ticks_elapsed_first];

        // Dequeue elapsed value.
        m_ticks_elapsed_first++;
        if (m_ticks_elapsed_first == CONTEXT_QUEUE_SIZE_MAX)
        {
            m_ticks_elapsed_first = 0;
        }

        m_ticks_latest += *p_ticks_elapsed;
        m_ticks_latest &= MAX_RTC_CNT;

        return true;
    }
    else
    {
        // No elapsed value in queue.
        *p_ticks_elapsed = 0;
        return false;
    }
}


/**@brief Function for handling the timer list deletions.
 *
 * @return     TRUE if Capture Compare register must be updated, FALSE otherwise.
 */
static bool list_deletions_handler(void)
{
    app_timer_id_t timer_id_old_head;
    uint8_t        user_id;

    // Remember the old head, so as to decide if new compare needs to be set.
    timer_id_old_head = m_timer_id_head;

    user_id = m_user_array_size;
    while (user_id--)
    {
        timer_user_t * p_user         = &mp_users[user_id];
        uint8_t        user_ops_first = p_user->first;
        
        while (user_ops_first != p_user->last)
        {
            timer_node_t *    p_timer;
            timer_user_op_t * p_user_op = &p_user->p_user_op_queue[user_ops_first];

            // Traverse to next operation in queue 
            user_ops_first++;
            if (user_ops_first == p_user->user_op_queue_size)
            {
                user_ops_first = 0;
            }

            switch (p_user_op->op_type)
            {
                case TIMER_USER_OP_TYPE_STOP:
                    // Delete node if timer is running.
                    p_timer = &mp_nodes[p_user_op->timer_id];
                    if (p_timer->is_running)
                    {
                        timer_list_remove(p_user_op->timer_id);
                        p_timer->is_running = false;
                    }
                    break;
                    
                case TIMER_USER_OP_TYPE_STOP_ALL:
                    // Delete list of running timers, and mark all timers as not running.
                    while (m_timer_id_head != TIMER_NULL)
                    {
                        timer_node_t * p_head = &mp_nodes[m_timer_id_head];

                        p_head->is_running = false;
                        m_timer_id_head    = p_head->next;
                    }
                    break;
                    
                default:
                    // No implementation needed.
                    break;
            }
        }
    }

    // Detect change in head of the list.
    return (m_timer_id_head != timer_id_old_head);
}


/**@brief Function for updating the timer list for expired timers.
 *
 * @param[in]  ticks_elapsed         Number of elapsed ticks.
 * @param[in]  ticks_previous        Previous known value of the RTC counter.
 * @param[out] p_restart_list_head   List of repeating timers to be restarted.
 */
static void expired_timers_handler(uint32_t         ticks_elapsed,
                                   uint32_t         ticks_previous,
                                   app_timer_id_t * p_restart_list_head)
{
    uint32_t ticks_expired = 0;

    while (m_timer_id_head != TIMER_NULL)
    {
        timer_node_t * p_timer;
        app_timer_id_t id_expired;

        // Auto variable for current timer node. 
        p_timer = &mp_nodes[m_timer_id_head];

        // Do nothing if timer did not expire. 
        if (ticks_elapsed < p_timer->ticks_to_expire)
        {
            p_timer->ticks_to_expire -= ticks_elapsed;
            break;
        }

        // Decrement ticks_elapsed and collect expired ticks. 
        ticks_elapsed -= p_timer->ticks_to_expire;
        ticks_expired += p_timer->ticks_to_expire;

        // Timer expired, set ticks_to_expire zero.
        p_timer->ticks_to_expire = 0;
        p_timer->is_running      = false;

