espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/components/libraries/timer/app_timer_ble_gzll.c
        // Remove the expired timer from head. 
        id_expired      = m_timer_id_head;
        m_timer_id_head = p_timer->next;

        // Timer will be restarted if periodic. 
        if (p_timer->ticks_periodic_interval != 0)
        {
            p_timer->ticks_at_start       = (ticks_previous + ticks_expired) & MAX_RTC_CNT;
            p_timer->ticks_first_interval = p_timer->ticks_periodic_interval;
            p_timer->next                 = *p_restart_list_head;
            *p_restart_list_head          = id_expired;
        }
    }
}


/**@brief Function for handling timer list insertions.
 *
 * @param[in]  p_restart_list_head   List of repeating timers to be restarted.
 *
 * @return     TRUE if Capture Compare register must be updated, FALSE otherwise.
 */
static bool list_insertions_handler(app_timer_id_t restart_list_head)
{
    app_timer_id_t timer_id_old_head;
    uint8_t        user_id;

    // Remember the old head, so as to decide if new compare needs to be set.
    timer_id_old_head = m_timer_id_head;

    user_id = m_user_array_size;
    while (user_id--)
    {
        timer_user_t * p_user = &mp_users[user_id];

        // Handle insertions of timers. 
        while ((restart_list_head != TIMER_NULL) || (p_user->first != p_user->last))
        {
            app_timer_id_t id_start;
            timer_node_t * p_timer;

            if (restart_list_head != TIMER_NULL)
            {
                id_start          = restart_list_head;
                p_timer           = &mp_nodes[id_start];
                restart_list_head = p_timer->next;
            }
            else
            {
                timer_user_op_t * p_user_op = &p_user->p_user_op_queue[p_user->first];

                p_user->first++;
                if (p_user->first == p_user->user_op_queue_size)
                {
                    p_user->first = 0;
                }

                id_start = p_user_op->timer_id;
                p_timer  = &mp_nodes[id_start];

                if ((p_user_op->op_type != TIMER_USER_OP_TYPE_START) || p_timer->is_running)
                {
                    continue;
                }

                p_timer->ticks_at_start          = p_user_op->params.start.ticks_at_start;
                p_timer->ticks_first_interval    = p_user_op->params.start.ticks_first_interval;
                p_timer->ticks_periodic_interval = p_user_op->params.start.ticks_periodic_interval;
                p_timer->p_context               = p_user_op->params.start.p_context;
            }

            // Prepare the node to be inserted. 
            if (((p_timer->ticks_at_start - m_ticks_latest) & MAX_RTC_CNT) < (MAX_RTC_CNT / 2))
            {
                p_timer->ticks_to_expire = ticks_diff_get(p_timer->ticks_at_start, m_ticks_latest) +
                                           p_timer->ticks_first_interval;
            }
            else
            {
                uint32_t delta_current_start;

                delta_current_start = ticks_diff_get(m_ticks_latest, p_timer->ticks_at_start);
                if (p_timer->ticks_first_interval > delta_current_start)
                {
                    p_timer->ticks_to_expire = p_timer->ticks_first_interval - delta_current_start;
                }
                else
                {
                    p_timer->ticks_to_expire = 0;
                }
            }
            p_timer->ticks_at_start       = 0;
            p_timer->ticks_first_interval = 0;
            p_timer->is_running           = true;
            p_timer->next                 = TIMER_NULL;

            // Insert into list.
            timer_list_insert(id_start);
        }
    }
    
    return (m_timer_id_head != timer_id_old_head);
}


/**@brief Function for updating the Capture Compare register.
 */
static void compare_reg_update(app_timer_id_t timer_id_head_old)
{
    // Setup the timeout for timers on the head of the list. 
    if (m_timer_id_head != TIMER_NULL)
    {
        uint32_t ticks_to_expire = mp_nodes[m_timer_id_head].ticks_to_expire;
        uint32_t counter         = rtc1_counter_get();
        uint32_t cc              = m_ticks_latest;
        uint32_t ticks_elapsed   = ticks_diff_get(counter, cc) + RTC_COMPARE_OFFSET_MIN;

        if (timer_id_head_old == TIMER_NULL)
        {
            // No timers were already running, start RTC.
            rtc1_start();
        }

        cc += (ticks_elapsed < ticks_to_expire) ? ticks_to_expire : ticks_elapsed;
        cc &= MAX_RTC_CNT;
        
        rtc1_compare0_set(cc);

        if (ticks_diff_get(rtc1_counter_get(), counter) > ticks_diff_get(cc, counter))
        {
            timer_timeouts_check_sched();
        }
    }
    else
    {
        // No timers are running, stop RTC.
        rtc1_stop();
    }
}


/**@brief Function for handling changes to the timer list.
 */
static void timer_list_handler(void)
{
    app_timer_id_t restart_list_head = TIMER_NULL;
    uint32_t       ticks_elapsed;
    uint32_t       ticks_previous;
    bool           ticks_have_elapsed;
    bool           compare_update;
    app_timer_id_t timer_id_head_old;
    
    // Back up the previous known tick and previous list head.
    ticks_previous    = m_ticks_latest;
    timer_id_head_old = m_timer_id_head;
    
    // Get number of elapsed ticks.
    ticks_have_elapsed = elapsed_ticks_acquire(&ticks_elapsed);

    // Handle list deletions.
    compare_update = list_deletions_handler();
    
    // Handle expired timers.
    if (ticks_have_elapsed)
    {
        expired_timers_handler(ticks_elapsed, ticks_previous, &restart_list_head);
        compare_update = true;
    }
    
    // Handle list insertions.
    if (list_insertions_handler(restart_list_head))
    {
        compare_update = true;
    }

    // Update compare register if necessary.
    if (compare_update)
    {
        compare_reg_update(timer_id_head_old);
    }
}


/**@brief Function for allocating a new operations queue entry.
 *
 * @param[in]  p_user   User that the entry is to be allocated for.
 *
 * @return     Pointer to allocated queue entry, or NULL if queue is full.
 */
static timer_user_op_t * user_op_alloc(timer_user_t * p_user)
{
    app_timer_id_t    last;
    timer_user_op_t * p_user_op;
    
    last = p_user->last + 1;
    if (last == p_user->user_op_queue_size)
    {
        last = 0;
    }
    if (last == p_user->first)
    {
        return NULL;
    }

    p_user_op    = &p_user->p_user_op_queue[p_user->last];
    p_user->last = last;
    
    return p_user_op;
}


/**@brief Function for scheduling a Timer Start operation.
 *
 * @param[in]  user_id           Id of user calling this function.
 * @param[in]  timer_id          Id of timer to start.
 * @param[in]  timeout_initial   Time (in ticks) to first timer expiry.
 * @param[in]  timeout_periodic  Time (in ticks) between periodic expiries.
 * @param[in]  p_context         General purpose pointer. Will be passed to the timeout handler when
 *                               the timer expires.
 * @return     NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t timer_start_op_schedule(timer_user_id_t user_id,
                                        app_timer_id_t  timer_id,
                                        uint32_t        timeout_initial,
                                        uint32_t        timeout_periodic,
                                        void *          p_context)
{
    timer_user_op_t * p_user_op = user_op_alloc(&mp_users[user_id]);
    if (p_user_op == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }
    
