espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/components/libraries/timer/app_timer_ble_gzll.c
    p_user_op->op_type                              = TIMER_USER_OP_TYPE_START;
    p_user_op->timer_id                             = timer_id;
    p_user_op->params.start.ticks_at_start          = rtc1_counter_get();
    p_user_op->params.start.ticks_first_interval    = timeout_initial;
    p_user_op->params.start.ticks_periodic_interval = timeout_periodic;
    p_user_op->params.start.p_context               = p_context;

    timer_list_handler_sched();

    return NRF_SUCCESS;
}


/**@brief Function for scheduling a Timer Stop operation.
 *
 * @param[in]  user_id    Id of user calling this function.
 * @param[in]  timer_id   Id of timer to stop.
 */
static uint32_t timer_stop_op_schedule(timer_user_id_t user_id, app_timer_id_t timer_id)
{
    timer_user_op_t * p_user_op = user_op_alloc(&mp_users[user_id]);
    if (p_user_op == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }
    
    p_user_op->op_type  = TIMER_USER_OP_TYPE_STOP;
    p_user_op->timer_id = timer_id;

    timer_list_handler_sched();

    return NRF_SUCCESS;
}


/**@brief Function for scheduling a Timer Stop All operation.
 *
 * @param[in]  user_id    Id of user calling this function.
 */
static uint32_t timer_stop_all_op_schedule(timer_user_id_t user_id)
{
    timer_user_op_t * p_user_op = user_op_alloc(&mp_users[user_id]);
    if (p_user_op == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }
    
    p_user_op->op_type  = TIMER_USER_OP_TYPE_STOP_ALL;
    p_user_op->timer_id = TIMER_NULL;

    timer_list_handler_sched();

    return NRF_SUCCESS;
}


/**@brief Function for handling the RTC1 interrupt.
 *
 * @details Checks for timeouts, and executes timeout handlers for expired timers.
 */
void RTC1_IRQHandler(void)
{
    // Clear all events (also unexpected ones).
    NRF_RTC1->EVENTS_COMPARE[0] = 0;
    NRF_RTC1->EVENTS_COMPARE[1] = 0;
    NRF_RTC1->EVENTS_COMPARE[2] = 0;
    NRF_RTC1->EVENTS_COMPARE[3] = 0;
    NRF_RTC1->EVENTS_TICK       = 0;
    NRF_RTC1->EVENTS_OVRFLW     = 0;

    // Check for expired timers.
    timer_timeouts_check();
}


/**@brief Function for handling the SWI0 interrupt.
 *
 * @details Performs all updates to the timer list.
 */
void SWI1_IRQHandler(void)
{
    timer_list_handler();
}


uint32_t app_timer_init(uint32_t                      prescaler,
                        uint8_t                       max_timers,
                        uint8_t                       op_queues_size,
                        void *                        p_buffer,
                        app_timer_evt_schedule_func_t evt_schedule_func)
{
    int i;

    // Check that buffer is correctly aligned.
    if (!is_word_aligned(p_buffer))
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    
    // Stop RTC to prevent any running timers from expiring (in case of reinitialization).
    rtc1_stop();
    
    m_evt_schedule_func = evt_schedule_func;

    // Initialize timer node array.
    m_node_array_size = max_timers;
    mp_nodes          = p_buffer;
    
    for (i = 0; i < max_timers; i++)
    {
        mp_nodes[i].state      = STATE_FREE;
        mp_nodes[i].is_running = false;
    }
    
    // Skip timer node array.
    p_buffer = &((uint8_t *)p_buffer)[max_timers * sizeof(timer_node_t)];
    
    // Initialize users array.
    m_user_array_size = APP_TIMER_INT_LEVELS;
    mp_users          = p_buffer;
    
    // Skip user array.
    p_buffer = &((uint8_t *)p_buffer)[APP_TIMER_INT_LEVELS * sizeof(timer_user_t)];

    // Initialize operation queues.
    for (i = 0; i < APP_TIMER_INT_LEVELS; i++)
    {
        timer_user_t * p_user = &mp_users[i];
        
        p_user->first              = 0;
        p_user->last               = 0;
        p_user->user_op_queue_size = op_queues_size;
        p_user->p_user_op_queue    = p_buffer;
    
        // Skip operation queue.
        p_buffer = &((uint8_t *)p_buffer)[op_queues_size * sizeof(timer_user_op_t)];
    }

    m_timer_id_head       = TIMER_NULL;
    m_ticks_elapsed_first = 0;
    m_ticks_elapsed_last  = 0;

    NVIC_ClearPendingIRQ(SWI1_IRQn);
    NVIC_SetPriority(SWI1_IRQn, SWI1_IRQ_PRI);
    NVIC_EnableIRQ(SWI1_IRQn);

    rtc1_init(prescaler);

    m_ticks_latest = rtc1_counter_get();
    
    return NRF_SUCCESS;
}


uint32_t app_timer_create(app_timer_id_t *            p_timer_id,
                          app_timer_mode_t            mode,
                          app_timer_timeout_handler_t timeout_handler)
{
    int i;

    // Check state and parameters.
    if (mp_nodes == NULL)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (timeout_handler == NULL)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    
    // Find free timer.
    for (i = 0; i < m_node_array_size; i++)
    {
        if (mp_nodes[i].state == STATE_FREE)
        {
            mp_nodes[i].state             = STATE_ALLOCATED;
            mp_nodes[i].mode              = mode;
            mp_nodes[i].p_timeout_handler = timeout_handler;
            
            *p_timer_id = i;
            return NRF_SUCCESS;
        }
    }
    
    return NRF_ERROR_NO_MEM;
}


/**@brief Function for creating a timer user id from the current interrupt level.
 *
 * @return     Timer user id.
*/
static timer_user_id_t user_id_get(void)
{
    timer_user_id_t ret;

    STATIC_ASSERT(APP_TIMER_INT_LEVELS == 3);
    
    switch (current_int_priority_get())
    {
        case APP_IRQ_PRIORITY_HIGH:
            ret = APP_HIGH_USER_ID;
            break;
            
        case APP_IRQ_PRIORITY_LOW:
            ret = APP_LOW_USER_ID;
            break;
            
        default:
            ret = THREAD_MODE_USER_ID;
            break;
    }
    
    return ret;
}


uint32_t app_timer_start(app_timer_id_t timer_id, uint32_t timeout_ticks, void * p_context)
{
    uint32_t timeout_periodic;
    
    // Check state and parameters.
    if (mp_nodes == NULL)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if ((timer_id >= m_node_array_size) || (timeout_ticks < 5))
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (mp_nodes[timer_id].state != STATE_ALLOCATED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    // Schedule timer start operation.
    timeout_periodic = (mp_nodes[timer_id].mode == APP_TIMER_MODE_REPEATED) ? timeout_ticks : 0;

    return timer_start_op_schedule(user_id_get(),
                                   timer_id,
                                   timeout_ticks,
                                   timeout_periodic,
                                   p_context);
}


uint32_t app_timer_stop(app_timer_id_t timer_id)
{
    // Check state and parameters.
    if (mp_nodes == NULL)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (timer_id >= m_node_array_size)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (mp_nodes[timer_id].state != STATE_ALLOCATED)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    // Schedule timer stop operation.
    return timer_stop_op_schedule(user_id_get(), timer_id);
}


uint32_t app_timer_stop_all(void)
{
    // Check state.
    if (mp_nodes == NULL)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    return timer_stop_all_op_schedule(user_id_get());
}


uint32_t app_timer_cnt_get(uint32_t * p_ticks)
{
    *p_ticks = rtc1_counter_get();
    return NRF_SUCCESS;
}


uint32_t app_timer_cnt_diff_compute(uint32_t   ticks_to,
                                    uint32_t   ticks_from,
                                    uint32_t * p_ticks_diff)
{
    *p_ticks_diff = ticks_diff_get(ticks_to, ticks_from);
    return NRF_SUCCESS;
}
